using System;

namespace _02._Sum_Digits
{
    internal class Program
    {
        static void Main(string[] args)
        {
         
            // ОБХОЖДАНЕ НА int

            string input = Console.ReadLine(); // създаваме стринг, в който ще се въвеждат числата(можем така да обхождаме и текст).
            int num = 0;

            

            for (int i = 0; i <= input.Length -1; i++) //цикъла се върти от 0 до дължината на стринга - 1 (защото броим позиците му от 0 а не от 1)
            {
                char currentChar = input[i];// правим един чар, който започва да обхожда стринга от първия му символ и придава на чара АСКИ стойноста на текущия символ. 0 = 48; 1 = 49 и тн.. 
                int currentDig = (int)currentChar - 48;// присвояваме на променливата стойността на чара (която е 49 ако пъряиа символ е 1) и вадим 48(стойността на нулата) за да разберем, че числото на първата позиция е 1. Ако числото на втора позиция е 6, сметката е 54(числото 6) - 48(числото 0) и  получаваме че чисото на втора позиция е 6. 
                num += currentDig; // на num присвояваме всяка следваща стойност на currentDigit. 
            }
            Console.WriteLine(num);



        }
    }
}
